#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.2`
* Working Directory 📂`./code/data-landing-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.shir_001.random_password.password: Refreshing state... [id=none][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.runtimes_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg][0m
[0m[1mazurerm_resource_group.shared_app_aut_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg][0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mazurerm_resource_group.management_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-mgmt-rg][0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.shared_app_exp_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mazurerm_resource_group.storage_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mmodule.databricks_automation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001][0m
[0m[1mmodule.datalake_curated.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur][0m
[0m[1mmodule.datalake_raw.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001][0m
[0m[1mmodule.datalake_enriched.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr][0m
[0m[1mazurerm_subnet.storage_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_route_table.route_table: Read complete after 2s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001][0m
[0m[1mazurerm_subnet.powerbi_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet.databricks_public_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet.shared_app_aut_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mazurerm_subnet.devops_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_subnet.databricks_private_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet.shared_app_exp_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet.databricks_public_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazurerm_subnet.databricks_private_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mazurerm_subnet.runtimes_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/8cd998e9-6266-d2ed-515b-33f10fa9086a][0m
[0m[1mazurerm_subnet_route_table_association.storage_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.storage_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.powerbi_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet_route_table_association.powerbi_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_public_subnet_002_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet_route_table_association.databricks_public_subnet_002_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet_network_security_group_association.shared_app_aut_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.shared_app_aut_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.devops_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.devops_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mmodule.databricks_experimentation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_private_subnet_001_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet_route_table_association.databricks_private_subnet_001_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mazurerm_subnet_route_table_association.shared_app_exp_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.shared_app_exp_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_public_subnet_001_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_public_subnet_001_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_private_subnet_002_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_virtual_network.virtual_network: Read complete after 2s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001][0m
[0m[1mazurerm_subnet_route_table_association.databricks_private_subnet_002_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-portal-pe][0m
[0m[1mazurerm_subnet_route_table_association.runtimes_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.runtimes_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-datafactory-pe][0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-kv001-pe][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Reading...[0m[0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-blob-pe][0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Read complete after 0s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.datalake_raw.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/managementPolicies/default][0m
[0m[1mmodule.datalake_raw.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/blobServices/default/containers/data][0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Read complete after 1s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-dfs-pe][0m
[0m[1mmodule.shir_001.azurerm_lb.lb: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-dfs-pe][0m
[0m[1mmodule.datalake_enriched.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_enriched.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/managementPolicies/default][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-blob-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-kv001-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/ca7ccc96-197c-f8d6-fa39-5a7777ee0b7b][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-blob-pe][0m
[0m[1mmodule.datalake_curated.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-dfs-pe][0m
[0m[1mmodule.datalake_curated.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/managementPolicies/default][0m
[0m[1mmodule.datalake_workspace.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-dfs-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_queue[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-queue-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-blob-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/managementPolicies/default][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_table[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-table-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/1ed03e24-4a7f-e600-c1b7-2bd3cec0e000][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/7676dddf-ebc9-97f9-5d42-b1bb838c0b00][0m
[0m[1mmodule.shir_001.azurerm_data_factory_integration_runtime_self_hosted.data_factory_shir: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001/integrationruntimes/mydlz01-dev-shir001][0m
[0m[1mmodule.shir_001.azurerm_lb_nat_pool.lb_nat_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/inboundNatPools/mydlz01-dev-shir001-natpool][0m
[0m[1mmodule.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/backendAddressPools/mydlz01-dev-shir001-backendaddresspool][0m
[0m[1mmodule.shir_001.azurerm_lb_probe.lb_probe: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/probes/mydlz01-dev-shir001-probe][0m
[0m[1mmodule.databricks_automation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-aut-dbw001][0m
[0m[1mmodule.databricks_experimentation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-exp-dbw001][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-blob-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-dfs-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-uiapi-pe][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_storage_account.datalake_raw: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-blob-pe][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-dfs-pe][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_storage_account.datalake_curated: Reading...[0m[0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_storage_account.datalake_enriched: Reading...[0m[0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_storage_account.datalake_workspace: Reading...[0m[0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-uiapi-pe][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_storage_account.datalake_raw: Read complete after 4s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw][0m
[0m[1mmodule.shir_001.azurerm_windows_virtual_machine_scale_set.vmss: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Compute/virtualMachineScaleSets/mydlz01-dev-shir001][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_storage_account.datalake_curated: Read complete after 4s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur][0m
[0m[1mmodule.shir_001.azurerm_lb_rule.lb_rule: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/loadBalancingRules/mydlz01-dev-shir001-rule][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_storage_account.datalake_enriched: Read complete after 4s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr][0m
[0m[1mmodule.databricks_automation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.data_products["dp-test-dev"].data.azurerm_storage_account.datalake_workspace: Read complete after 3s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp][0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=E963F6819300179D][0m
[0m[1mmodule.databricks_automation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=4175911308037159|9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=E963F6819300179E][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=2769391400051353|9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=E964305C0B000000][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=E964305C0B000001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.data_products["dp-test-dev"].azapi_resource.container_curated[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "container_curated" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m metadata     = {}
                  [32m+[0m[0m publicAccess = "None"
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "dp-test-dev"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/blobServices/default"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2022-09-01"
    }

[1m  # module.data_products["dp-test-dev"].azapi_resource.container_enriched[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "container_enriched" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m metadata     = {}
                  [32m+[0m[0m publicAccess = "None"
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "dp-test-dev"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/blobServices/default"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2022-09-01"
    }

[1m  # module.data_products["dp-test-dev"].azapi_resource.container_raw[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "container_raw" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m metadata     = {}
                  [32m+[0m[0m publicAccess = "None"
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "dp-test-dev"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/blobServices/default"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2022-09-01"
    }

[1m  # module.data_products["dp-test-dev"].azapi_resource.subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "100.10.10.10/28"
                  [32m+[0m[0m delegations                       = []
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "DataProductSubnet-dp-test-dev"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_products["dp-test-dev"].azurerm_resource_group.data_product_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "data_product_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "dp-test-dev-rg"
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }
    }

[1m  # module.data_products["dp-test-dev"].azurerm_role_assignment.user_assigned_identity_roleassignment_container_curated[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_container_curated" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["dp-test-dev"].azurerm_role_assignment.user_assigned_identity_roleassignment_container_enriched[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_container_enriched" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["dp-test-dev"].azurerm_role_assignment.user_assigned_identity_roleassignment_container_raw[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_container_raw" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["dp-test-dev"].azurerm_role_assignment.user_assigned_identity_roleassignment_subnet[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_subnet" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Network Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["dp-test-dev"].azurerm_user_assigned_identity.user_assigned_identity[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "dp-test-dev-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "dp-test-dev-rg"
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1mPlan:[0m 10 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>